---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.DetailLine
source: html/d73c9461-40b5-d2de-00fb-9990c0ddc345.htm
---
# DetailLine Members

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.